# Used Cars Price Analysis Dataset
## Purpose
> A dataset containing all the required fields to build AI/ML models to find the price 
## Description
> ### --> 6019 records of used cars dataset, containing:

        -   Name
        -   Location
        -   Year
        -   Kilometers_Driven
        -   Fuel_Type
        -   Transmission
        -   Owner_Type
        -   Mileage
        -   Engine
        -   Power
        -   Seats
        -   New_Price
        -   Price

In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_df=pd.read_csv('../data/raw/used_cars_price.csv')
df=raw_df.copy()

In [3]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [4]:
df.shape

(6019, 13)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               6019 non-null   object
 1   Location           6019 non-null   object
 2   Year               6019 non-null   int64
 3   Kilometers_Driven  6019 non-null   int64
 4   Fuel_Type          6019 non-null   object
 5   Transmission       6019 non-null   object
 6   Owner_Type         6019 non-null   object
 7   Mileage            6017 non-null   object
 8   Engine             5983 non-null   object
 9   Power              5983 non-null   object
 10  Seats              5977 non-null   float64
 11  New_Price          824 non-null    object
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 611.4+ KB

In [6]:
df.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [7]:
df.describe()

              Year  Kilometers_Driven        Seats        Price
count  6019.000000       6.019000e+03  5977.000000  6019.000000
mean   2013.358199       5.873838e+04     5.278735     9.479468
std       3.269742       9.126884e+04     0.808840    11.187917
min    1998.000000       1.710000e+02     0.000000     0.440000
25%    2011.000000       3.400000e+04     5.000000     3.500000
50%    2014.000000       5.300000e+04     5.000000     5.640000
75%    2016.000000       7.300000e+04     5.000000     9.950000
max    2019.000000       6.500000e+06    10.000000   160.000000

In [8]:
df[df.duplicated()==True]

Empty DataFrame
Columns: [Name, Location, Year, Kilometers_Driven, Fuel_Type, Transmission, Owner_Type, Mileage, Engine, Power, Seats, New_Price, Price]
Index: []

# Data Cleaning

In [9]:
df.columns=df.columns.str.lower()

In [10]:
df.columns

Index(['name', 'location', 'year', 'kilometers_driven', 'fuel_type',
       'transmission', 'owner_type', 'mileage', 'engine', 'power', 'seats',
       'new_price', 'price'],
      dtype='object')

In [11]:
df.drop('new_price',axis=1,inplace=True)

In [12]:
df.fuel_type.unique()

array(['CNG', 'Diesel', 'Petrol', 'LPG', 'Electric'], dtype=object)

In [13]:
df.fuel_type.tail()

6014    Diesel
6015    Diesel
6016    Diesel
6017    Petrol
6018    Diesel
Name: fuel_type, dtype: object

In [14]:
df[df['fuel_type']=='Electric']

,name,location,year,kilometers_driven,fuel_type,transmission,owner_type,mileage,engine,power,seats,price
4446,Mahindra E Verito D4,Chennai,2016,50000,Electric,Automatic,First,NaN,72 CC,41 bhp,5.0,13.00
4904,Toyota Prius 2009-2016 Z4,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798 CC,73 bhp,5.0,12.75

In [15]:
def map_fuel_type(x):
    if (x=='Petrol') or (x=='LPG'):
        return 'Diesel'
    else:
        return x
        
df['fuel_type']=df['fuel_type'].apply(map_fuel_type)

In [16]:
df.fuel_type.unique()

array(['CNG', 'Diesel', 'Electric'], dtype=object)

In [17]:
df.engine

0        998 CC
1       1582 CC
2       1199 CC
3       1248 CC
4       1968 CC
         ...
6014    1248 CC
6015    1120 CC
6016    2498 CC
6017     998 CC
6018     936 CC
Name: engine, Length: 6019, dtype: object

In [18]:
def map_engine(x):
    return str(x).split(' ')[0]

## ==> The Unit Of Mileage (kmpl,km/kg)
## ==> The Unit Of Engine CC
## ==> The Unit Of Power bhp

In [19]:
df['mileage']=df['mileage'].apply(map_engine)

In [20]:
df['mileage']=df.mileage.astype(float)

In [21]:
df['engine']=df['engine'].apply(map_engine)

In [22]:
df['engine']=df.engine.astype(float)

In [23]:
df['power']=df['power'].apply(map_engine)

In [24]:
df[df['power']=='null']

,name,location,year,kilometers_driven,fuel_type,transmission,owner_type,mileage,engine,power,seats,price
76,Ford Fiesta 1.4 SXi TDCi,Jaipur,2008,111111,Diesel,Manual,First,17.80,1399.0,null,5.0,2.00
79,Hyundai Santro Xing XL,Hyderabad,2005,87591,Diesel,Manual,First,0.00,1086.0,null,5.0,1.30
89,Hyundai Santro Xing XO,Hyderabad,2007,73745,Diesel,Manual,First,17.00,1086.0,null,5.0,2.10
120,Hyundai Santro Xing XL eRLX Euro III,Mumbai,2005,102000,Diesel,Manual,Second,17.00,1086.0,null,5.0,0.85
143,Hyundai Santro Xing XO eRLX Euro II,Kochi,2008,80759,Diesel,Manual,Third,17.00,1086.0,null,5.0,1.67
...,...,...,...,...,...,...,...,...,...,...,...,...
5873,Hyundai Santro Xing XO eRLX Euro II,Pune,2006,47200,Diesel,Manual,Second,17.00,1086.0,null,5.0,1.20
5893,Maruti Estilo LXI,Chennai,2008,51000,Diesel,Manual,Second,19.50,1061.0,null,NaN,1.75
5925,Skoda Laura Classic 1.8 TSI,Pune,2010,85000,Diesel,Manual,First,17.50,1798.0,null,5.0,2.85
5943,Mahindra Jeep MM 540 DP,Chennai,2002,75000,Diesel,Manual,First,0.00,2112.0,null,6.0,1.70
5985,Toyota Etios GD,Delhi,2013,70000,Diesel,Manual,First,23.59,1364.0,null,5.0,3.88

In [25]:
ind=list(df[df['power']=='null'].index.values)
ind

[76,
 79,
 89,
 120,
 143,
 227,
 245,
 262,
 307,
 308,
 386,
 424,
 428,
 443,
 472,
 575,
 631,
 647,
 648,
 739,
 748,
 829,
 915,
 926,
 934,
 1068,
 1143,
 1153,
 1271,
 1319,
 1345,
 1388,
 1419,
 1555,
 1578,
 1649,
 1672,
 1857,
 1999,
 2053,
 2130,
 2164,
 2262,
 2267,
 2305,
 2343,
 2369,
 2393,
 2441,
 2450,
 2497,
 2501,
 2527,
 2579,
 2597,
 2635,
 2640,
 2891,
 3033,
 3061,
 3104,
 3189,
 3247,
 3290,
 3439,
 3516,
 3533,
 3589,
 3628,
 3638,
 3645,
 3669,
 3733,
 3800,
 3882,
 3898,
 3930,
 3999,
 4077,
 4080,
 4351,
 4354,
 4629,
 4709,
 4714,
 4744,
 4830,
 4886,
 4900,
 4954,
 5065,
 5119,
 5228,
 5426,
 5438,
 5458,
 5529,
 5533,
 5647,
 5755,
 5759,
 5861,
 5873,
 5893,
 5925,
 5943,
 5985]

In [26]:
df.drop(ind,axis=0,inplace=True)

In [27]:
df[df['power']=='null']

Empty DataFrame
Columns: [name, location, year, kilometers_driven, fuel_type, transmission, owner_type, mileage, engine, power, seats, price]
Index: []

In [28]:
df['power']=df.power.astype(float)

In [29]:
df.isnull().sum()

name                  0
location              0
year                  0
kilometers_driven     0
fuel_type             0
transmission          0
owner_type            0
mileage               2
engine               36
power                36
seats                38
price                 0
dtype: int64

In [30]:
df.dropna(axis=0,inplace=True)

In [31]:
df.isnull().sum()

name                 0
location             0
year                 0
kilometers_driven    0
fuel_type            0
transmission         0
owner_type           0
mileage              0
engine               0
power                0
seats                0
price                0
dtype: int64

In [32]:
df.shape

(5872, 12)

In [33]:
df.head()

,name,location,year,kilometers_driven,fuel_type,transmission,owner_type,mileage,engine,power,seats,price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50
2,Honda Jazz V,Chennai,2011,46000,Diesel,Manual,First,18.20,1199.0,88.70,5.0,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,17.74

In [34]:
df.to_csv('../data/processed/EDA&Cleaning.csv')